# создаем переменную и присваиваем ей значение строки с произвольным текстом
my_string = input()
# выводим в консоль количество символов строки
print(len(my_string))
# выводим в консоль отображение строки в верхнем регистре
print (my_string.upper())
# выводим в консоль отображение строки в нижнем регистре
print (my_string.lower())
# выводим в консоль удаление всех пробелов в строке путем замены
print (my_string.replace(' ', ''))
# выводим в консоль первый символ строки
print (my_string[0])
# выводим в консоль последний символ строки
print (my_string[-1])