name = "Vladimir"        # присвоение переменной name значения Vladimir строкового типа
print (name)             # вывод переменной в консоль
age = 26                 # присвоение переменной age значения 26 целочисленного типа
print (age)              # вывод в консоль переменной age
new_age = age + 1        # перезапись значения переменной age
print (new_age)          # вывод в консколь перезаписанной переменной
Is_Student = True        # присвоение переменной Is_Student значения логического типа
print (Is_Student)       # вывод переменной в консоль