# присваиваем переменной example значение жидкокристаллический строкового типа
example = 'жидкокристаллический'

# выводим в консоль первый символ этой строки
print (example [0])

# выводим в консоль последний символ этой строки (используя отрицательный индекс)
print (example [-1])

# выводим в консоль вторую половину этой строки
print (example [10:20])

# выводим в консоль строку наоборот
print (example [::-1])

# выводим в консоль каждый второй символ этой строки
print (example [1:20:2])